espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_eco5_struct.h
/** Type of hp_active_backup_clk register
 *  need_des
 */
typedef union {
    struct {
        /** hp_active_backup_icg_func_en : R/W; bitpos: [31:0]; default: 0;
         *  need_des
         */
        uint32_t hp_active_backup_icg_func_en:32;
    };
    uint32_t val;
} pmu_hp_active_backup_clk_reg_t;

/** Type of hp_active_sysclk register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:26;
        /** hp_active_dig_sys_clk_no_div : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t hp_active_dig_sys_clk_no_div:1;
        /** hp_active_icg_sys_clock_en : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t hp_active_icg_sys_clock_en:1;
        /** hp_active_sys_clk_slp_sel : R/W; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t hp_active_sys_clk_slp_sel:1;
        /** hp_active_icg_slp_sel : R/W; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t hp_active_icg_slp_sel:1;
        /** hp_active_dig_sys_clk_sel : R/W; bitpos: [31:30]; default: 0;
         *  need_des
         */
        uint32_t hp_active_dig_sys_clk_sel:2;
    };
    uint32_t val;
} pmu_hp_active_sysclk_reg_t;

/** Type of hp_active_hp_regulator0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** lp_dbias_vol : RO; bitpos: [8:4]; default: 24;
         *  need_des
         */
        uint32_t lp_dbias_vol:5;
        /** hp_dbias_vol : RO; bitpos: [13:9]; default: 24;
         *  need_des
         */
        uint32_t hp_dbias_vol:5;
        /** dig_regulator0_dbias_sel : R/W; bitpos: [14]; default: 1;
         *  need_des
         */
        uint32_t dig_regulator0_dbias_sel:1;
        /** dig_dbias_init : WT; bitpos: [15]; default: 0;
         *  need_des
         */
        uint32_t dig_dbias_init:1;
        /** hp_active_hp_regulator_slp_mem_xpd : R/W; bitpos: [16]; default: 1;
         *  need_des
         */
        uint32_t hp_active_hp_regulator_slp_mem_xpd:1;
        /** hp_active_hp_regulator_slp_logic_xpd : R/W; bitpos: [17]; default: 1;
         *  need_des
         */
        uint32_t hp_active_hp_regulator_slp_logic_xpd:1;
        /** hp_active_hp_regulator_xpd : R/W; bitpos: [18]; default: 1;
         *  need_des
         */
        uint32_t hp_active_hp_regulator_xpd:1;
        /** hp_active_hp_regulator_slp_mem_dbias : R/W; bitpos: [22:19]; default: 12;
         *  need_des
         */
        uint32_t hp_active_hp_regulator_slp_mem_dbias:4;
        /** hp_active_hp_regulator_slp_logic_dbias : R/W; bitpos: [26:23]; default: 12;
         *  need_des
         */
        uint32_t hp_active_hp_regulator_slp_logic_dbias:4;
        /** hp_active_hp_regulator_dbias : R/W; bitpos: [31:27]; default: 24;
         *  need_des
         */
        uint32_t hp_active_hp_regulator_dbias:5;
    };
    uint32_t val;
} pmu_hp_active_hp_regulator0_reg_t;

/** Type of hp_active_hp_regulator1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:26;
        /** hp_active_hp_regulator_drv_b : R/W; bitpos: [31:26]; default: 0;
         *  need_des
         */
        uint32_t hp_active_hp_regulator_drv_b:6;
    };
    uint32_t val;
} pmu_hp_active_hp_regulator1_reg_t;

/** Type of hp_active_xtal register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** hp_active_xpd_xtal : R/W; bitpos: [31]; default: 1;
         *  need_des
         */
        uint32_t hp_active_xpd_xtal:1;
    };
    uint32_t val;
} pmu_hp_active_xtal_reg_t;

/** Type of hp_modem_dig_power register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:21;
        /** hp_modem_dcdc_switch_pd_en : R/W; bitpos: [21]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_dcdc_switch_pd_en:1;
        /** hp_modem_hp_mem_dslp : WT; bitpos: [22]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_hp_mem_dslp:1;
        /** hp_modem_pd_hp_mem_pd_en : WT; bitpos: [26:23]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_pd_hp_mem_pd_en:4;
        /** hp_modem_pd_hp_wifi_pd_en : WT; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_pd_hp_wifi_pd_en:1;
        uint32_t reserved_28:1;
        /** hp_modem_pd_hp_cpu_pd_en : WT; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_pd_hp_cpu_pd_en:1;
        /** hp_modem_pd_cnnt_pd_en : WT; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_pd_cnnt_pd_en:1;
        /** hp_modem_pd_top_pd_en : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_pd_top_pd_en:1;
    };
    uint32_t val;
} pmu_hp_modem_dig_power_reg_t;

/** Type of hp_modem_icg_hp_func register
 *  need_des
 */
typedef union {
    struct {
        /** hp_modem_dig_icg_func_en : WT; bitpos: [31:0]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_dig_icg_func_en:32;
    };
    uint32_t val;
} pmu_hp_modem_icg_hp_func_reg_t;

/** Type of hp_modem_icg_hp_apb register
 *  need_des
 */
typedef union {
    struct {
        /** hp_modem_dig_icg_apb_en : WT; bitpos: [31:0]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_dig_icg_apb_en:32;
    };
    uint32_t val;
} pmu_hp_modem_icg_hp_apb_reg_t;

/** Type of hp_modem_icg_modem register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:30;
        /** hp_modem_dig_icg_modem_code : WT; bitpos: [31:30]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_dig_icg_modem_code:2;
    };
    uint32_t val;
} pmu_hp_modem_icg_modem_reg_t;

/** Type of hp_modem_hp_sys_cntl register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:23;
        /** hp_modem_hp_power_det_bypass : WT; bitpos: [23]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_hp_power_det_bypass:1;
        /** hp_modem_uart_wakeup_en : WT; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_uart_wakeup_en:1;
        /** hp_modem_lp_pad_hold_all : WT; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_lp_pad_hold_all:1;
        /** hp_modem_hp_pad_hold_all : WT; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_hp_pad_hold_all:1;
        /** hp_modem_dig_pad_slp_sel : WT; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_dig_pad_slp_sel:1;
        /** hp_modem_dig_pause_wdt : WT; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_dig_pause_wdt:1;
        /** hp_modem_dig_cpu_stall : WT; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_dig_cpu_stall:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} pmu_hp_modem_hp_sys_cntl_reg_t;

