espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_eco5_struct.h
/** Type of hp_modem_hp_ck_power register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:21;
        /** hp_modem_i2c_iso_en : WT; bitpos: [21]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_i2c_iso_en:1;
        /** hp_modem_i2c_retention : WT; bitpos: [22]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_i2c_retention:1;
        /** hp_modem_xpd_pll_i2c : WT; bitpos: [26:23]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_xpd_pll_i2c:4;
        /** hp_modem_xpd_pll : WT; bitpos: [30:27]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_xpd_pll:4;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} pmu_hp_modem_hp_ck_power_reg_t;

/** Type of hp_modem_bias register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:18;
        /** hp_modem_dcm_vset : WT; bitpos: [22:18]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_dcm_vset:5;
        /** hp_modem_dcm_mode : WT; bitpos: [24:23]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_dcm_mode:2;
        /** hp_modem_xpd_bias : WT; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_xpd_bias:1;
        /** hp_modem_dbg_atten : WT; bitpos: [29:26]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_dbg_atten:4;
        /** hp_modem_pd_cur : WT; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_pd_cur:1;
        /** hp_modem_bias_sleep : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_bias_sleep:1;
    };
    uint32_t val;
} pmu_hp_modem_bias_reg_t;

/** Type of hp_modem_backup register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** hp_sleep2modem_backup_modem_clk_code : WT; bitpos: [5:4]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep2modem_backup_modem_clk_code:2;
        uint32_t reserved_6:4;
        /** hp_modem_retention_mode : WT; bitpos: [10]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_retention_mode:1;
        /** hp_sleep2modem_retention_en : WT; bitpos: [11]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep2modem_retention_en:1;
        uint32_t reserved_12:2;
        /** hp_sleep2modem_backup_clk_sel : WT; bitpos: [15:14]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep2modem_backup_clk_sel:2;
        uint32_t reserved_16:4;
        /** hp_sleep2modem_backup_mode : WT; bitpos: [22:20]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep2modem_backup_mode:3;
        uint32_t reserved_23:6;
        /** hp_sleep2modem_backup_en : WT; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep2modem_backup_en:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} pmu_hp_modem_backup_reg_t;

/** Type of hp_modem_backup_clk register
 *  need_des
 */
typedef union {
    struct {
        /** hp_modem_backup_icg_func_en : WT; bitpos: [31:0]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_backup_icg_func_en:32;
    };
    uint32_t val;
} pmu_hp_modem_backup_clk_reg_t;

/** Type of hp_modem_sysclk register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:26;
        /** hp_modem_dig_sys_clk_no_div : WT; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_dig_sys_clk_no_div:1;
        /** hp_modem_icg_sys_clock_en : WT; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_icg_sys_clock_en:1;
        /** hp_modem_sys_clk_slp_sel : WT; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_sys_clk_slp_sel:1;
        /** hp_modem_icg_slp_sel : WT; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_icg_slp_sel:1;
        /** hp_modem_dig_sys_clk_sel : WT; bitpos: [31:30]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_dig_sys_clk_sel:2;
    };
    uint32_t val;
} pmu_hp_modem_sysclk_reg_t;

/** Type of hp_modem_hp_regulator0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** hp_modem_hp_regulator_slp_mem_xpd : WT; bitpos: [16]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_hp_regulator_slp_mem_xpd:1;
        /** hp_modem_hp_regulator_slp_logic_xpd : WT; bitpos: [17]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_hp_regulator_slp_logic_xpd:1;
        /** hp_modem_hp_regulator_xpd : WT; bitpos: [18]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_hp_regulator_xpd:1;
        /** hp_modem_hp_regulator_slp_mem_dbias : WT; bitpos: [22:19]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_hp_regulator_slp_mem_dbias:4;
        /** hp_modem_hp_regulator_slp_logic_dbias : WT; bitpos: [26:23]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_hp_regulator_slp_logic_dbias:4;
        /** hp_modem_hp_regulator_dbias : WT; bitpos: [31:27]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_hp_regulator_dbias:5;
    };
    uint32_t val;
} pmu_hp_modem_hp_regulator0_reg_t;

/** Type of hp_modem_hp_regulator1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** hp_modem_hp_regulator_drv_b : WT; bitpos: [31:8]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_hp_regulator_drv_b:24;
    };
    uint32_t val;
} pmu_hp_modem_hp_regulator1_reg_t;

/** Type of hp_modem_xtal register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** hp_modem_xpd_xtal : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t hp_modem_xpd_xtal:1;
    };
    uint32_t val;
} pmu_hp_modem_xtal_reg_t;

/** Type of hp_sleep_dig_power register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:21;
        /** hp_sleep_dcdc_switch_pd_en : R/W; bitpos: [21]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_dcdc_switch_pd_en:1;
        /** hp_sleep_hp_mem_dslp : R/W; bitpos: [22]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_hp_mem_dslp:1;
        /** hp_sleep_pd_hp_mem_pd_en : R/W; bitpos: [23]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_pd_hp_mem_pd_en:1;
        uint32_t reserved_24:5;
        /** hp_sleep_pd_hp_cpu_pd_en : R/W; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_pd_hp_cpu_pd_en:1;
        /** hp_sleep_pd_cnnt_pd_en : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_pd_cnnt_pd_en:1;
        /** hp_sleep_pd_top_pd_en : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_pd_top_pd_en:1;
    };
    uint32_t val;
} pmu_hp_sleep_dig_power_reg_t;

/** Type of hp_sleep_icg_hp_func register
 *  need_des
 */
typedef union {
    struct {
        /** hp_sleep_dig_icg_func_en : R/W; bitpos: [31:0]; default: 4294967295;
         *  need_des
         */
        uint32_t hp_sleep_dig_icg_func_en:32;
    };
    uint32_t val;
} pmu_hp_sleep_icg_hp_func_reg_t;

/** Type of hp_sleep_icg_hp_apb register
 *  need_des
 */
typedef union {
    struct {
        /** hp_sleep_dig_icg_apb_en : R/W; bitpos: [31:0]; default: 4294967295;
         *  need_des
         */
        uint32_t hp_sleep_dig_icg_apb_en:32;
    };
    uint32_t val;
} pmu_hp_sleep_icg_hp_apb_reg_t;

/** Type of hp_sleep_icg_modem register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:30;
        /** hp_sleep_dig_icg_modem_code : R/W; bitpos: [31:30]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_dig_icg_modem_code:2;
    };
    uint32_t val;
} pmu_hp_sleep_icg_modem_reg_t;

/** Type of hp_sleep_hp_sys_cntl register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:23;
        /** hp_sleep_hp_power_det_bypass : R/W; bitpos: [23]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_hp_power_det_bypass:1;
        /** hp_sleep_uart_wakeup_en : R/W; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_uart_wakeup_en:1;
        /** hp_sleep_lp_pad_hold_all : R/W; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_lp_pad_hold_all:1;
        /** hp_sleep_hp_pad_hold_all : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_hp_pad_hold_all:1;
        /** hp_sleep_dig_pad_slp_sel : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_dig_pad_slp_sel:1;
        /** hp_sleep_dig_pause_wdt : R/W; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_dig_pause_wdt:1;
        /** hp_sleep_dig_cpu_stall : R/W; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t hp_sleep_dig_cpu_stall:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} pmu_hp_sleep_hp_sys_cntl_reg_t;

