espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_eco5_struct.h
/** Type of imm_i2c_iso register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:30;
        /** tie_high_i2c_iso_en : WT; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t tie_high_i2c_iso_en:1;
        /** tie_low_i2c_iso_en : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t tie_low_i2c_iso_en:1;
    };
    uint32_t val;
} pmu_imm_i2c_iso_reg_t;

/** Type of power_wait_timer0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** dg_hp_powerdown_timer : R/W; bitpos: [13:5]; default: 255;
         *  need_des
         */
        uint32_t dg_hp_powerdown_timer:9;
        /** dg_hp_powerup_timer : R/W; bitpos: [22:14]; default: 255;
         *  need_des
         */
        uint32_t dg_hp_powerup_timer:9;
        /** dg_hp_wait_timer : R/W; bitpos: [31:23]; default: 255;
         *  need_des
         */
        uint32_t dg_hp_wait_timer:9;
    };
    uint32_t val;
} pmu_power_wait_timer0_reg_t;

/** Type of power_wait_timer1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** dg_lp_powerdown_timer : R/W; bitpos: [13:5]; default: 255;
         *  need_des
         */
        uint32_t dg_lp_powerdown_timer:9;
        /** dg_lp_powerup_timer : R/W; bitpos: [22:14]; default: 255;
         *  need_des
         */
        uint32_t dg_lp_powerup_timer:9;
        /** dg_lp_wait_timer : R/W; bitpos: [31:23]; default: 255;
         *  need_des
         */
        uint32_t dg_lp_wait_timer:9;
    };
    uint32_t val;
} pmu_power_wait_timer1_reg_t;

/** Type of power_pd_top_cntl register
 *  need_des
 */
typedef union {
    struct {
        /** force_top_reset : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t force_top_reset:1;
        /** force_top_iso : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t force_top_iso:1;
        /** force_top_pu : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t force_top_pu:1;
        /** force_top_no_reset : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t force_top_no_reset:1;
        /** force_top_no_iso : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t force_top_no_iso:1;
        /** force_top_pd : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t force_top_pd:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} pmu_power_pd_top_cntl_reg_t;

/** Type of power_pd_cnnt_cntl register
 *  need_des
 */
typedef union {
    struct {
        /** force_cnnt_reset : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t force_cnnt_reset:1;
        /** force_cnnt_iso : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t force_cnnt_iso:1;
        /** force_cnnt_pu : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t force_cnnt_pu:1;
        /** force_cnnt_no_reset : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t force_cnnt_no_reset:1;
        /** force_cnnt_no_iso : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t force_cnnt_no_iso:1;
        /** force_cnnt_pd : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t force_cnnt_pd:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} pmu_power_pd_cnnt_cntl_reg_t;

/** Type of power_pd_hpmem_cntl register
 *  need_des
 */
typedef union {
    struct {
        /** force_hp_mem_reset : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t force_hp_mem_reset:1;
        /** force_hp_mem_iso : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t force_hp_mem_iso:1;
        /** force_hp_mem_pu : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t force_hp_mem_pu:1;
        /** force_hp_mem_no_reset : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t force_hp_mem_no_reset:1;
        /** force_hp_mem_no_iso : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t force_hp_mem_no_iso:1;
        /** force_hp_mem_pd : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t force_hp_mem_pd:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} pmu_power_pd_hpmem_cntl_reg_t;

/** Type of power_pd_top_mask register
 *  need_des
 */
typedef union {
    struct {
        /** xpd_top_mask : R/W; bitpos: [4:0]; default: 0;
         *  need_des
         */
        uint32_t xpd_top_mask:5;
        uint32_t reserved_5:22;
        /** pd_top_mask : R/W; bitpos: [31:27]; default: 0;
         *  need_des
         */
        uint32_t pd_top_mask:5;
    };
    uint32_t val;
} pmu_power_pd_top_mask_reg_t;

/** Type of power_pd_cnnt_mask register
 *  need_des
 */
typedef union {
    struct {
        /** xpd_cnnt_mask : R/W; bitpos: [4:0]; default: 0;
         *  need_des
         */
        uint32_t xpd_cnnt_mask:5;
        uint32_t reserved_5:22;
        /** pd_cnnt_mask : R/W; bitpos: [31:27]; default: 0;
         *  need_des
         */
        uint32_t pd_cnnt_mask:5;
    };
    uint32_t val;
} pmu_power_pd_cnnt_mask_reg_t;

/** Type of power_pd_hpmem_mask register
 *  need_des
 */
typedef union {
    struct {
        /** xpd_hp_mem_mask : R/W; bitpos: [5:0]; default: 0;
         *  need_des
         */
        uint32_t xpd_hp_mem_mask:6;
        uint32_t reserved_6:20;
        /** pd_hp_mem_mask : R/W; bitpos: [31:26]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_mem_mask:6;
    };
    uint32_t val;
} pmu_power_pd_hpmem_mask_reg_t;

/** Type of power_dcdc_switch register
 *  need_des
 */
typedef union {
    struct {
        /** force_dcdc_switch_pu : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t force_dcdc_switch_pu:1;
        /** force_dcdc_switch_pd : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t force_dcdc_switch_pd:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pmu_power_dcdc_switch_reg_t;

