espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_eco5_struct.h
/** Type of backup_cfg register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** backup_sys_clk_no_div : R/W; bitpos: [31]; default: 1;
         *  need_des
         */
        uint32_t backup_sys_clk_no_div:1;
    };
    uint32_t val;
} pmu_backup_cfg_reg_t;

/** Type of int_raw register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:14;
        /** pmu_0p1a_cnt_target0_reach_0_hp_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  reg_0p1a_0_counter after xpd reach target0
         */
        uint32_t pmu_0p1a_cnt_target0_reach_0_hp_int_raw:1;
        /** pmu_0p1a_cnt_target1_reach_0_hp_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  reg_0p1a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p1a_cnt_target1_reach_0_hp_int_raw:1;
        /** pmu_0p1a_cnt_target0_reach_1_hp_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  reg_0p1a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p1a_cnt_target0_reach_1_hp_int_raw:1;
        /** pmu_0p1a_cnt_target1_reach_1_hp_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  reg_0p1a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p1a_cnt_target1_reach_1_hp_int_raw:1;
        /** pmu_0p2a_cnt_target0_reach_0_hp_int_raw : R/WTC/SS; bitpos: [18]; default: 0;
         *  reg_0p2a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p2a_cnt_target0_reach_0_hp_int_raw:1;
        /** pmu_0p2a_cnt_target1_reach_0_hp_int_raw : R/WTC/SS; bitpos: [19]; default: 0;
         *  reg_0p2a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p2a_cnt_target1_reach_0_hp_int_raw:1;
        /** pmu_0p2a_cnt_target0_reach_1_hp_int_raw : R/WTC/SS; bitpos: [20]; default: 0;
         *  reg_0p2a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p2a_cnt_target0_reach_1_hp_int_raw:1;
        /** pmu_0p2a_cnt_target1_reach_1_hp_int_raw : R/WTC/SS; bitpos: [21]; default: 0;
         *  reg_0p2a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p2a_cnt_target1_reach_1_hp_int_raw:1;
        /** pmu_0p3a_cnt_target0_reach_0_hp_int_raw : R/WTC/SS; bitpos: [22]; default: 0;
         *  reg_0p3a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p3a_cnt_target0_reach_0_hp_int_raw:1;
        /** pmu_0p3a_cnt_target1_reach_0_hp_int_raw : R/WTC/SS; bitpos: [23]; default: 0;
         *  reg_0p3a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p3a_cnt_target1_reach_0_hp_int_raw:1;
        /** pmu_0p3a_cnt_target0_reach_1_hp_int_raw : R/WTC/SS; bitpos: [24]; default: 0;
         *  reg_0p3a_0_counter after xpd reach target0
         */
        uint32_t pmu_0p3a_cnt_target0_reach_1_hp_int_raw:1;
        /** pmu_0p3a_cnt_target1_reach_1_hp_int_raw : R/WTC/SS; bitpos: [25]; default: 0;
         *  reg_0p3a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p3a_cnt_target1_reach_1_hp_int_raw:1;
        uint32_t reserved_26:1;
        /** lp_cpu_exc_int_raw : R/WTC/SS; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_exc_int_raw:1;
        /** sdio_idle_int_raw : R/WTC/SS; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t sdio_idle_int_raw:1;
        /** sw_int_raw : R/WTC/SS; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t sw_int_raw:1;
        /** soc_sleep_reject_int_raw : R/WTC/SS; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t soc_sleep_reject_int_raw:1;
        /** soc_wakeup_int_raw : R/WTC/SS; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t soc_wakeup_int_raw:1;
    };
    uint32_t val;
} pmu_int_raw_reg_t;

/** Type of hp_int_st register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:14;
        /** pmu_0p1a_cnt_target0_reach_0_hp_int_st : RO; bitpos: [14]; default: 0;
         *  reg_0p1a_0_counter after xpd reach target0
         */
        uint32_t pmu_0p1a_cnt_target0_reach_0_hp_int_st:1;
        /** pmu_0p1a_cnt_target1_reach_0_hp_int_st : RO; bitpos: [15]; default: 0;
         *  reg_0p1a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p1a_cnt_target1_reach_0_hp_int_st:1;
        /** pmu_0p1a_cnt_target0_reach_1_hp_int_st : RO; bitpos: [16]; default: 0;
         *  reg_0p1a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p1a_cnt_target0_reach_1_hp_int_st:1;
        /** pmu_0p1a_cnt_target1_reach_1_hp_int_st : RO; bitpos: [17]; default: 0;
         *  reg_0p1a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p1a_cnt_target1_reach_1_hp_int_st:1;
        /** pmu_0p2a_cnt_target0_reach_0_hp_int_st : RO; bitpos: [18]; default: 0;
         *  reg_0p2a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p2a_cnt_target0_reach_0_hp_int_st:1;
        /** pmu_0p2a_cnt_target1_reach_0_hp_int_st : RO; bitpos: [19]; default: 0;
         *  reg_0p2a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p2a_cnt_target1_reach_0_hp_int_st:1;
        /** pmu_0p2a_cnt_target0_reach_1_hp_int_st : RO; bitpos: [20]; default: 0;
         *  reg_0p2a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p2a_cnt_target0_reach_1_hp_int_st:1;
        /** pmu_0p2a_cnt_target1_reach_1_hp_int_st : RO; bitpos: [21]; default: 0;
         *  reg_0p2a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p2a_cnt_target1_reach_1_hp_int_st:1;
        /** pmu_0p3a_cnt_target0_reach_0_hp_int_st : RO; bitpos: [22]; default: 0;
         *  reg_0p3a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p3a_cnt_target0_reach_0_hp_int_st:1;
        /** pmu_0p3a_cnt_target1_reach_0_hp_int_st : RO; bitpos: [23]; default: 0;
         *  reg_0p3a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p3a_cnt_target1_reach_0_hp_int_st:1;
        /** pmu_0p3a_cnt_target0_reach_1_hp_int_st : RO; bitpos: [24]; default: 0;
         *  reg_0p3a_0_counter after xpd reach target0
         */
        uint32_t pmu_0p3a_cnt_target0_reach_1_hp_int_st:1;
        /** pmu_0p3a_cnt_target1_reach_1_hp_int_st : RO; bitpos: [25]; default: 0;
         *  reg_0p3a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p3a_cnt_target1_reach_1_hp_int_st:1;
        uint32_t reserved_26:1;
        /** lp_cpu_exc_int_st : RO; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_exc_int_st:1;
        /** sdio_idle_int_st : RO; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t sdio_idle_int_st:1;
        /** sw_int_st : RO; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t sw_int_st:1;
        /** soc_sleep_reject_int_st : RO; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t soc_sleep_reject_int_st:1;
        /** soc_wakeup_int_st : RO; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t soc_wakeup_int_st:1;
    };
    uint32_t val;
} pmu_hp_int_st_reg_t;

