espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_eco5_struct.h
/** Type of lp_int_raw register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:13;
        /** lp_cpu_sleep_reject_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_sleep_reject_int_raw:1;
        /** pmu_0p1a_cnt_target0_reach_0_lp_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  reg_0p1a_0_counter after xpd reach target0
         */
        uint32_t pmu_0p1a_cnt_target0_reach_0_lp_int_raw:1;
        /** pmu_0p1a_cnt_target1_reach_0_lp_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  reg_0p1a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p1a_cnt_target1_reach_0_lp_int_raw:1;
        /** pmu_0p1a_cnt_target0_reach_1_lp_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  reg_0p1a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p1a_cnt_target0_reach_1_lp_int_raw:1;
        /** pmu_0p1a_cnt_target1_reach_1_lp_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  reg_0p1a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p1a_cnt_target1_reach_1_lp_int_raw:1;
        /** pmu_0p2a_cnt_target0_reach_0_lp_int_raw : R/WTC/SS; bitpos: [18]; default: 0;
         *  reg_0p2a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p2a_cnt_target0_reach_0_lp_int_raw:1;
        /** pmu_0p2a_cnt_target1_reach_0_lp_int_raw : R/WTC/SS; bitpos: [19]; default: 0;
         *  reg_0p2a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p2a_cnt_target1_reach_0_lp_int_raw:1;
        /** pmu_0p2a_cnt_target0_reach_1_lp_int_raw : R/WTC/SS; bitpos: [20]; default: 0;
         *  reg_0p2a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p2a_cnt_target0_reach_1_lp_int_raw:1;
        /** pmu_0p2a_cnt_target1_reach_1_lp_int_raw : R/WTC/SS; bitpos: [21]; default: 0;
         *  reg_0p2a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p2a_cnt_target1_reach_1_lp_int_raw:1;
        /** pmu_0p3a_cnt_target0_reach_0_lp_int_raw : R/WTC/SS; bitpos: [22]; default: 0;
         *  reg_0p3a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p3a_cnt_target0_reach_0_lp_int_raw:1;
        /** pmu_0p3a_cnt_target1_reach_0_lp_int_raw : R/WTC/SS; bitpos: [23]; default: 0;
         *  reg_0p3a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p3a_cnt_target1_reach_0_lp_int_raw:1;
        /** pmu_0p3a_cnt_target0_reach_1_lp_int_raw : R/WTC/SS; bitpos: [24]; default: 0;
         *  reg_0p3a_0_counter after xpd reach target0
         */
        uint32_t pmu_0p3a_cnt_target0_reach_1_lp_int_raw:1;
        /** pmu_0p3a_cnt_target1_reach_1_lp_int_raw : R/WTC/SS; bitpos: [25]; default: 0;
         *  reg_0p3a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p3a_cnt_target1_reach_1_lp_int_raw:1;
        /** lp_cpu_wakeup_int_raw : R/WTC/SS; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_wakeup_int_raw:1;
        /** sleep_switch_active_end_int_raw : R/WTC/SS; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t sleep_switch_active_end_int_raw:1;
        /** active_switch_sleep_end_int_raw : R/WTC/SS; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t active_switch_sleep_end_int_raw:1;
        /** sleep_switch_active_start_int_raw : R/WTC/SS; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t sleep_switch_active_start_int_raw:1;
        /** active_switch_sleep_start_int_raw : R/WTC/SS; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t active_switch_sleep_start_int_raw:1;
        /** hp_sw_trigger_int_raw : R/WTC/SS; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t hp_sw_trigger_int_raw:1;
    };
    uint32_t val;
} pmu_lp_int_raw_reg_t;

/** Type of lp_int_st register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:13;
        /** lp_cpu_sleep_reject_int_st : RO; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_sleep_reject_int_st:1;
        /** pmu_0p1a_cnt_target0_reach_0_lp_int_st : RO; bitpos: [14]; default: 0;
         *  reg_0p1a_0_counter after xpd reach target0
         */
        uint32_t pmu_0p1a_cnt_target0_reach_0_lp_int_st:1;
        /** pmu_0p1a_cnt_target1_reach_0_lp_int_st : RO; bitpos: [15]; default: 0;
         *  reg_0p1a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p1a_cnt_target1_reach_0_lp_int_st:1;
        /** pmu_0p1a_cnt_target0_reach_1_lp_int_st : RO; bitpos: [16]; default: 0;
         *  reg_0p1a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p1a_cnt_target0_reach_1_lp_int_st:1;
        /** pmu_0p1a_cnt_target1_reach_1_lp_int_st : RO; bitpos: [17]; default: 0;
         *  reg_0p1a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p1a_cnt_target1_reach_1_lp_int_st:1;
        /** pmu_0p2a_cnt_target0_reach_0_lp_int_st : RO; bitpos: [18]; default: 0;
         *  reg_0p2a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p2a_cnt_target0_reach_0_lp_int_st:1;
        /** pmu_0p2a_cnt_target1_reach_0_lp_int_st : RO; bitpos: [19]; default: 0;
         *  reg_0p2a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p2a_cnt_target1_reach_0_lp_int_st:1;
        /** pmu_0p2a_cnt_target0_reach_1_lp_int_st : RO; bitpos: [20]; default: 0;
         *  reg_0p2a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p2a_cnt_target0_reach_1_lp_int_st:1;
        /** pmu_0p2a_cnt_target1_reach_1_lp_int_st : RO; bitpos: [21]; default: 0;
         *  reg_0p2a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p2a_cnt_target1_reach_1_lp_int_st:1;
        /** pmu_0p3a_cnt_target0_reach_0_lp_int_st : RO; bitpos: [22]; default: 0;
         *  reg_0p3a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p3a_cnt_target0_reach_0_lp_int_st:1;
        /** pmu_0p3a_cnt_target1_reach_0_lp_int_st : RO; bitpos: [23]; default: 0;
         *  reg_0p3a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p3a_cnt_target1_reach_0_lp_int_st:1;
        /** pmu_0p3a_cnt_target0_reach_1_lp_int_st : RO; bitpos: [24]; default: 0;
         *  reg_0p3a_0_counter after xpd reach target0
         */
        uint32_t pmu_0p3a_cnt_target0_reach_1_lp_int_st:1;
        /** pmu_0p3a_cnt_target1_reach_1_lp_int_st : RO; bitpos: [25]; default: 0;
         *  reg_0p3a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p3a_cnt_target1_reach_1_lp_int_st:1;
        /** lp_cpu_wakeup_int_st : RO; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_wakeup_int_st:1;
        /** sleep_switch_active_end_int_st : RO; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t sleep_switch_active_end_int_st:1;
        /** active_switch_sleep_end_int_st : RO; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t active_switch_sleep_end_int_st:1;
        /** sleep_switch_active_start_int_st : RO; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t sleep_switch_active_start_int_st:1;
        /** active_switch_sleep_start_int_st : RO; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t active_switch_sleep_start_int_st:1;
        /** hp_sw_trigger_int_st : RO; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t hp_sw_trigger_int_st:1;
    };
    uint32_t val;
} pmu_lp_int_st_reg_t;

/** Type of lp_int_ena register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:13;
        /** lp_cpu_sleep_reject_int_ena : R/W; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_sleep_reject_int_ena:1;
        /** pmu_0p1a_cnt_target0_reach_0_lp_int_ena : R/W; bitpos: [14]; default: 0;
         *  reg_0p1a_0_counter after xpd reach target0
         */
        uint32_t pmu_0p1a_cnt_target0_reach_0_lp_int_ena:1;
        /** pmu_0p1a_cnt_target1_reach_0_lp_int_ena : R/W; bitpos: [15]; default: 0;
         *  reg_0p1a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p1a_cnt_target1_reach_0_lp_int_ena:1;
        /** pmu_0p1a_cnt_target0_reach_1_lp_int_ena : R/W; bitpos: [16]; default: 0;
         *  reg_0p1a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p1a_cnt_target0_reach_1_lp_int_ena:1;
        /** pmu_0p1a_cnt_target1_reach_1_lp_int_ena : R/W; bitpos: [17]; default: 0;
         *  reg_0p1a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p1a_cnt_target1_reach_1_lp_int_ena:1;
        /** pmu_0p2a_cnt_target0_reach_0_lp_int_ena : R/W; bitpos: [18]; default: 0;
         *  reg_0p2a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p2a_cnt_target0_reach_0_lp_int_ena:1;
        /** pmu_0p2a_cnt_target1_reach_0_lp_int_ena : R/W; bitpos: [19]; default: 0;
         *  reg_0p2a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p2a_cnt_target1_reach_0_lp_int_ena:1;
        /** pmu_0p2a_cnt_target0_reach_1_lp_int_ena : R/W; bitpos: [20]; default: 0;
         *  reg_0p2a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p2a_cnt_target0_reach_1_lp_int_ena:1;
        /** pmu_0p2a_cnt_target1_reach_1_lp_int_ena : R/W; bitpos: [21]; default: 0;
         *  reg_0p2a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p2a_cnt_target1_reach_1_lp_int_ena:1;
        /** pmu_0p3a_cnt_target0_reach_0_lp_int_ena : R/W; bitpos: [22]; default: 0;
         *  reg_0p3a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p3a_cnt_target0_reach_0_lp_int_ena:1;
        /** pmu_0p3a_cnt_target1_reach_0_lp_int_ena : R/W; bitpos: [23]; default: 0;
         *  reg_0p3a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p3a_cnt_target1_reach_0_lp_int_ena:1;
        /** pmu_0p3a_cnt_target0_reach_1_lp_int_ena : R/W; bitpos: [24]; default: 0;
         *  reg_0p3a_0_counter after xpd reach target0
         */
        uint32_t pmu_0p3a_cnt_target0_reach_1_lp_int_ena:1;
        /** pmu_0p3a_cnt_target1_reach_1_lp_int_ena : R/W; bitpos: [25]; default: 0;
         *  reg_0p3a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p3a_cnt_target1_reach_1_lp_int_ena:1;
        /** lp_cpu_wakeup_int_ena : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_wakeup_int_ena:1;
        /** sleep_switch_active_end_int_ena : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t sleep_switch_active_end_int_ena:1;
        /** active_switch_sleep_end_int_ena : R/W; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t active_switch_sleep_end_int_ena:1;
        /** sleep_switch_active_start_int_ena : R/W; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t sleep_switch_active_start_int_ena:1;
        /** active_switch_sleep_start_int_ena : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t active_switch_sleep_start_int_ena:1;
        /** hp_sw_trigger_int_ena : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t hp_sw_trigger_int_ena:1;
    };
    uint32_t val;
} pmu_lp_int_ena_reg_t;

