espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_eco5_struct.h
/** Type of lp_int_clr register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:13;
        /** lp_cpu_sleep_reject_lp_int_clr : WT; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_sleep_reject_lp_int_clr:1;
        /** pmu_0p1a_cnt_target0_reach_0_lp_int_clr : WT; bitpos: [14]; default: 0;
         *  reg_0p1a_0_counter after xpd reach target0
         */
        uint32_t pmu_0p1a_cnt_target0_reach_0_lp_int_clr:1;
        /** pmu_0p1a_cnt_target1_reach_0_lp_int_clr : WT; bitpos: [15]; default: 0;
         *  reg_0p1a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p1a_cnt_target1_reach_0_lp_int_clr:1;
        /** pmu_0p1a_cnt_target0_reach_1_lp_int_clr : WT; bitpos: [16]; default: 0;
         *  reg_0p1a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p1a_cnt_target0_reach_1_lp_int_clr:1;
        /** pmu_0p1a_cnt_target1_reach_1_lp_int_clr : WT; bitpos: [17]; default: 0;
         *  reg_0p1a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p1a_cnt_target1_reach_1_lp_int_clr:1;
        /** pmu_0p2a_cnt_target0_reach_0_lp_int_clr : WT; bitpos: [18]; default: 0;
         *  reg_0p2a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p2a_cnt_target0_reach_0_lp_int_clr:1;
        /** pmu_0p2a_cnt_target1_reach_0_lp_int_clr : WT; bitpos: [19]; default: 0;
         *  reg_0p2a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p2a_cnt_target1_reach_0_lp_int_clr:1;
        /** pmu_0p2a_cnt_target0_reach_1_lp_int_clr : WT; bitpos: [20]; default: 0;
         *  reg_0p2a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p2a_cnt_target0_reach_1_lp_int_clr:1;
        /** pmu_0p2a_cnt_target1_reach_1_lp_int_clr : WT; bitpos: [21]; default: 0;
         *  reg_0p2a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p2a_cnt_target1_reach_1_lp_int_clr:1;
        /** pmu_0p3a_cnt_target0_reach_0_lp_int_clr : WT; bitpos: [22]; default: 0;
         *  reg_0p3a_0 counter after xpd reach target0
         */
        uint32_t pmu_0p3a_cnt_target0_reach_0_lp_int_clr:1;
        /** pmu_0p3a_cnt_target1_reach_0_lp_int_clr : WT; bitpos: [23]; default: 0;
         *  reg_0p3a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p3a_cnt_target1_reach_0_lp_int_clr:1;
        /** pmu_0p3a_cnt_target0_reach_1_lp_int_clr : WT; bitpos: [24]; default: 0;
         *  reg_0p3a_0_counter after xpd reach target0
         */
        uint32_t pmu_0p3a_cnt_target0_reach_1_lp_int_clr:1;
        /** pmu_0p3a_cnt_target1_reach_1_lp_int_clr : WT; bitpos: [25]; default: 0;
         *  reg_0p3a_1_counter after xpd reach target1
         */
        uint32_t pmu_0p3a_cnt_target1_reach_1_lp_int_clr:1;
        /** lp_cpu_wakeup_int_clr : WT; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_wakeup_int_clr:1;
        /** sleep_switch_active_end_int_clr : WT; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t sleep_switch_active_end_int_clr:1;
        /** active_switch_sleep_end_int_clr : WT; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t active_switch_sleep_end_int_clr:1;
        /** sleep_switch_active_start_int_clr : WT; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t sleep_switch_active_start_int_clr:1;
        /** active_switch_sleep_start_int_clr : WT; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t active_switch_sleep_start_int_clr:1;
        /** hp_sw_trigger_int_clr : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t hp_sw_trigger_int_clr:1;
    };
    uint32_t val;
} pmu_lp_int_clr_reg_t;

/** Type of lp_cpu_pwr0 register
 *  need_des
 */
typedef union {
    struct {
        /** lp_cpu_waiti_rdy : RO; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_waiti_rdy:1;
        /** lp_cpu_stall_rdy : RO; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_stall_rdy:1;
        uint32_t reserved_2:16;
        /** lp_cpu_force_stall : R/W; bitpos: [18]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_force_stall:1;
        /** lp_cpu_slp_waiti_flag_en : R/W; bitpos: [19]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_slp_waiti_flag_en:1;
        /** lp_cpu_slp_stall_flag_en : R/W; bitpos: [20]; default: 1;
         *  need_des
         */
        uint32_t lp_cpu_slp_stall_flag_en:1;
        /** lp_cpu_slp_stall_wait : R/W; bitpos: [28:21]; default: 255;
         *  need_des
         */
        uint32_t lp_cpu_slp_stall_wait:8;
        /** lp_cpu_slp_stall_en : R/W; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_slp_stall_en:1;
        /** lp_cpu_slp_reset_en : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_slp_reset_en:1;
        /** lp_cpu_slp_bypass_intr_en : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_slp_bypass_intr_en:1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr0_reg_t;

/** Type of lp_cpu_pwr1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** lp_cpu_sleep_req : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_sleep_req:1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr1_reg_t;

/** Type of lp_cpu_pwr2 register
 *  need_des
 */
typedef union {
    struct {
        /** lp_cpu_wakeup_en : R/W; bitpos: [30:0]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_wakeup_en:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr2_reg_t;

/** Type of lp_cpu_pwr3 register
 *  need_des
 */
typedef union {
    struct {
        /** lp_cpu_wakeup_cause : RO; bitpos: [30:0]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_wakeup_cause:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr3_reg_t;

