espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_eco5_struct.h
/** Type of lp_cpu_pwr4 register
 *  need_des
 */
typedef union {
    struct {
        /** lp_cpu_reject_en : R/W; bitpos: [30:0]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_reject_en:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr4_reg_t;

/** Type of lp_cpu_pwr5 register
 *  need_des
 */
typedef union {
    struct {
        /** lp_cpu_reject_cause : RO; bitpos: [30:0]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_reject_cause:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr5_reg_t;

/** Type of hp_lp_cpu_comm register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:30;
        /** lp_trigger_hp : WT; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t lp_trigger_hp:1;
        /** hp_trigger_lp : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t hp_trigger_lp:1;
    };
    uint32_t val;
} pmu_hp_lp_cpu_comm_reg_t;

/** Type of hp_regulator_cfg register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** dig_regulator_en_cal : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t dig_regulator_en_cal:1;
    };
    uint32_t val;
} pmu_hp_regulator_cfg_reg_t;

/** Type of main_state register
 *  need_des
 */
typedef union {
    struct {
        /** enable_cali_pmu_cntl : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t enable_cali_pmu_cntl:1;
        uint32_t reserved_1:10;
        /** pmu_main_last_st_state : RO; bitpos: [17:11]; default: 1;
         *  need_des
         */
        uint32_t pmu_main_last_st_state:7;
        /** pmu_main_tar_st_state : RO; bitpos: [24:18]; default: 4;
         *  need_des
         */
        uint32_t pmu_main_tar_st_state:7;
        /** pmu_main_cur_st_state : RO; bitpos: [31:25]; default: 1;
         *  need_des
         */
        uint32_t pmu_main_cur_st_state:7;
    };
    uint32_t val;
} pmu_main_state_reg_t;

/** Type of pwr_state register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:13;
        /** pmu_backup_st_state : RO; bitpos: [17:13]; default: 1;
         *  need_des
         */
        uint32_t pmu_backup_st_state:5;
        /** pmu_lp_pwr_st_state : RO; bitpos: [22:18]; default: 0;
         *  need_des
         */
        uint32_t pmu_lp_pwr_st_state:5;
        /** pmu_hp_pwr_st_state : RO; bitpos: [31:23]; default: 1;
         *  need_des
         */
        uint32_t pmu_hp_pwr_st_state:9;
    };
    uint32_t val;
} pmu_pwr_state_reg_t;

/** Type of ext_ldo_p0_0p1a register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:6;
        /** pmu_0p1a_cnt_clr_0 : WT; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_cnt_clr_0:1;
        /** pmu_0p1a_force_tieh_sel_0 : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_force_tieh_sel_0:1;
        /** pmu_0p1a_xpd_0 : R/W; bitpos: [8]; default: 1;
         *  need_des
         */
        uint32_t pmu_0p1a_xpd_0:1;
        /** pmu_0p1a_tieh_sel_0 : R/W; bitpos: [11:9]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_tieh_sel_0:3;
        /** pmu_0p1a_tieh_pos_en_0 : R/W; bitpos: [12]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_tieh_pos_en_0:1;
        /** pmu_0p1a_tieh_neg_en_0 : R/W; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_tieh_neg_en_0:1;
        /** pmu_0p1a_tieh_0 : R/W; bitpos: [14]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_tieh_0:1;
        /** pmu_0p1a_target1_0 : R/W; bitpos: [22:15]; default: 64;
         *  need_des
         */
        uint32_t pmu_0p1a_target1_0:8;
        /** pmu_0p1a_target0_0 : R/W; bitpos: [30:23]; default: 128;
         *  need_des
         */
        uint32_t pmu_0p1a_target0_0:8;
        /** pmu_0p1a_ldo_cnt_prescaler_sel_0 : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_ldo_cnt_prescaler_sel_0:1;
    };
    uint32_t val;
} pmu_ext_ldo_p0_0p1a_reg_t;

/** Type of ext_ldo_p0_0p1a_ana register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:23;
        /** ana_0p1a_mul_0 : R/W; bitpos: [25:23]; default: 2;
         *  need_des
         */
        uint32_t ana_0p1a_mul_0:3;
        /** ana_0p1a_en_vdet_0 : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t ana_0p1a_en_vdet_0:1;
        /** ana_0p1a_en_cur_lim_0 : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t ana_0p1a_en_cur_lim_0:1;
        /** ana_0p1a_dref_0 : R/W; bitpos: [31:28]; default: 11;
         *  need_des
         */
        uint32_t ana_0p1a_dref_0:4;
    };
    uint32_t val;
} pmu_ext_ldo_p0_0p1a_ana_reg_t;

/** Type of ext_ldo_p0_0p2a register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:6;
        /** pmu_0p2a_cnt_clr_0 : WT; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_cnt_clr_0:1;
        /** 0p2a_force_tieh_sel_0 : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_force_tieh_sel_0:1;
        /** pmu_0p2a_xpd_0 : R/W; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_xpd_0:1;
        /** pmu_0p2a_tieh_sel_0 : R/W; bitpos: [11:9]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_tieh_sel_0:3;
        /** pmu_0p2a_tieh_pos_en_0 : R/W; bitpos: [12]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_tieh_pos_en_0:1;
        /** pmu_0p2a_tieh_neg_en_0 : R/W; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_tieh_neg_en_0:1;
        /** pmu_0p2a_tieh_0 : R/W; bitpos: [14]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_tieh_0:1;
        /** pmu_0p2a_target1_0 : R/W; bitpos: [22:15]; default: 64;
         *  need_des
         */
        uint32_t pmu_0p2a_target1_0:8;
        /** pmu_0p2a_target0_0 : R/W; bitpos: [30:23]; default: 128;
         *  need_des
         */
        uint32_t pmu_0p2a_target0_0:8;
        /** pmu_0p2a_ldo_cnt_prescaler_sel_0 : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_ldo_cnt_prescaler_sel_0:1;
    };
    uint32_t val;
} pmu_ext_ldo_p0_0p2a_reg_t;

/** Type of ext_ldo_p0_0p2a_ana register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:23;
        /** ana_0p2a_mul_0 : R/W; bitpos: [25:23]; default: 0;
         *  need_des
         */
        uint32_t ana_0p2a_mul_0:3;
        /** ana_0p2a_en_vdet_0 : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t ana_0p2a_en_vdet_0:1;
        /** ana_0p2a_en_cur_lim_0 : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t ana_0p2a_en_cur_lim_0:1;
        /** ana_0p2a_dref_0 : R/W; bitpos: [31:28]; default: 10;
         *  need_des
         */
        uint32_t ana_0p2a_dref_0:4;
    };
    uint32_t val;
} pmu_ext_ldo_p0_0p2a_ana_reg_t;

/** Type of ext_ldo_p0_0p3a register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:6;
        /** pmu_0p3a_cnt_clr_0 : WT; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_cnt_clr_0:1;
        /** pmu_0p3a_force_tieh_sel_0 : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_force_tieh_sel_0:1;
        /** pmu_0p3a_xpd_0 : R/W; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_xpd_0:1;
        /** pmu_0p3a_tieh_sel_0 : R/W; bitpos: [11:9]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_tieh_sel_0:3;
        /** pmu_0p3a_tieh_pos_en_0 : R/W; bitpos: [12]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_tieh_pos_en_0:1;
        /** pmu_0p3a_tieh_neg_en_0 : R/W; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_tieh_neg_en_0:1;
        /** pmu_0p3a_tieh_0 : R/W; bitpos: [14]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_tieh_0:1;
        /** pmu_0p3a_target1_0 : R/W; bitpos: [22:15]; default: 64;
         *  need_des
         */
        uint32_t pmu_0p3a_target1_0:8;
        /** pmu_0p3a_target0_0 : R/W; bitpos: [30:23]; default: 128;
         *  need_des
         */
        uint32_t pmu_0p3a_target0_0:8;
        /** pmu_0p3a_ldo_cnt_prescaler_sel_0 : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_ldo_cnt_prescaler_sel_0:1;
    };
    uint32_t val;
} pmu_ext_ldo_p0_0p3a_reg_t;

/** Type of ext_ldo_p0_0p3a_ana register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:23;
        /** ana_0p3a_mul_0 : R/W; bitpos: [25:23]; default: 0;
         *  need_des
         */
        uint32_t ana_0p3a_mul_0:3;
        /** ana_0p3a_en_vdet_0 : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t ana_0p3a_en_vdet_0:1;
        /** ana_0p3a_en_cur_lim_0 : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t ana_0p3a_en_cur_lim_0:1;
        /** ana_0p3a_dref_0 : R/W; bitpos: [31:28]; default: 10;
         *  need_des
         */
        uint32_t ana_0p3a_dref_0:4;
    };
    uint32_t val;
} pmu_ext_ldo_p0_0p3a_ana_reg_t;

/** Type of ext_ldo_p1_0p1a register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:6;
        /** pmu_0p1a_cnt_clr_1 : WT; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_cnt_clr_1:1;
        /** pmu_0p1a_force_tieh_sel_1 : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_force_tieh_sel_1:1;
        /** pmu_0p1a_xpd_1 : R/W; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_xpd_1:1;
        /** pmu_0p1a_tieh_sel_1 : R/W; bitpos: [11:9]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_tieh_sel_1:3;
        /** pmu_0p1a_tieh_pos_en_1 : R/W; bitpos: [12]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_tieh_pos_en_1:1;
        /** pmu_0p1a_tieh_neg_en_1 : R/W; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_tieh_neg_en_1:1;
        /** pmu_0p1a_tieh_1 : R/W; bitpos: [14]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_tieh_1:1;
        /** pmu_0p1a_target1_1 : R/W; bitpos: [22:15]; default: 64;
         *  need_des
         */
        uint32_t pmu_0p1a_target1_1:8;
        /** pmu_0p1a_target0_1 : R/W; bitpos: [30:23]; default: 128;
         *  need_des
         */
        uint32_t pmu_0p1a_target0_1:8;
        /** pmu_0p1a_ldo_cnt_prescaler_sel_1 : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p1a_ldo_cnt_prescaler_sel_1:1;
    };
    uint32_t val;
} pmu_ext_ldo_p1_0p1a_reg_t;

/** Type of ext_ldo_p1_0p1a_ana register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:23;
        /** ana_0p1a_mul_1 : R/W; bitpos: [25:23]; default: 0;
         *  need_des
         */
        uint32_t ana_0p1a_mul_1:3;
        /** ana_0p1a_en_vdet_1 : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t ana_0p1a_en_vdet_1:1;
        /** ana_0p1a_en_cur_lim_1 : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t ana_0p1a_en_cur_lim_1:1;
        /** ana_0p1a_dref_1 : R/W; bitpos: [31:28]; default: 10;
         *  need_des
         */
        uint32_t ana_0p1a_dref_1:4;
    };
    uint32_t val;
} pmu_ext_ldo_p1_0p1a_ana_reg_t;

/** Type of ext_ldo_p1_0p2a register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:6;
        /** pmu_0p2a_cnt_clr_1 : WT; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_cnt_clr_1:1;
        /** pmu_0p2a_force_tieh_sel_1 : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_force_tieh_sel_1:1;
        /** pmu_0p2a_xpd_1 : R/W; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_xpd_1:1;
        /** pmu_0p2a_tieh_sel_1 : R/W; bitpos: [11:9]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_tieh_sel_1:3;
        /** pmu_0p2a_tieh_pos_en_1 : R/W; bitpos: [12]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_tieh_pos_en_1:1;
        /** pmu_0p2a_tieh_neg_en_1 : R/W; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_tieh_neg_en_1:1;
        /** pmu_0p2a_tieh_1 : R/W; bitpos: [14]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_tieh_1:1;
        /** pmu_0p2a_target1_1 : R/W; bitpos: [22:15]; default: 64;
         *  need_des
         */
        uint32_t pmu_0p2a_target1_1:8;
        /** pmu_0p2a_target0_1 : R/W; bitpos: [30:23]; default: 128;
         *  need_des
         */
        uint32_t pmu_0p2a_target0_1:8;
        /** pmu_0p2a_ldo_cnt_prescaler_sel_1 : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p2a_ldo_cnt_prescaler_sel_1:1;
    };
    uint32_t val;
} pmu_ext_ldo_p1_0p2a_reg_t;

/** Type of ext_ldo_p1_0p2a_ana register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:23;
        /** ana_0p2a_mul_1 : R/W; bitpos: [25:23]; default: 0;
         *  need_des
         */
        uint32_t ana_0p2a_mul_1:3;
        /** ana_0p2a_en_vdet_1 : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t ana_0p2a_en_vdet_1:1;
        /** ana_0p2a_en_cur_lim_1 : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t ana_0p2a_en_cur_lim_1:1;
        /** ana_0p2a_dref_1 : R/W; bitpos: [31:28]; default: 10;
         *  need_des
         */
        uint32_t ana_0p2a_dref_1:4;
    };
    uint32_t val;
} pmu_ext_ldo_p1_0p2a_ana_reg_t;

/** Type of ext_ldo_p1_0p3a register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:6;
        /** pmu_0p3a_cnt_clr_1 : WT; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_cnt_clr_1:1;
        /** pmu_0p3a_force_tieh_sel_1 : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_force_tieh_sel_1:1;
        /** pmu_0p3a_xpd_1 : R/W; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_xpd_1:1;
        /** pmu_0p3a_tieh_sel_1 : R/W; bitpos: [11:9]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_tieh_sel_1:3;
        /** pmu_0p3a_tieh_pos_en_1 : R/W; bitpos: [12]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_tieh_pos_en_1:1;
        /** pmu_0p3a_tieh_neg_en_1 : R/W; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_tieh_neg_en_1:1;
        /** pmu_0p3a_tieh_1 : R/W; bitpos: [14]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_tieh_1:1;
        /** pmu_0p3a_target1_1 : R/W; bitpos: [22:15]; default: 64;
         *  need_des
         */
        uint32_t pmu_0p3a_target1_1:8;
        /** pmu_0p3a_target0_1 : R/W; bitpos: [30:23]; default: 128;
         *  need_des
         */
        uint32_t pmu_0p3a_target0_1:8;
        /** pmu_0p3a_ldo_cnt_prescaler_sel_1 : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t pmu_0p3a_ldo_cnt_prescaler_sel_1:1;
    };
    uint32_t val;
} pmu_ext_ldo_p1_0p3a_reg_t;

/** Type of ext_ldo_p1_0p3a_ana register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:23;
        /** ana_0p3a_mul_1 : R/W; bitpos: [25:23]; default: 0;
         *  need_des
         */
        uint32_t ana_0p3a_mul_1:3;
        /** ana_0p3a_en_vdet_1 : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t ana_0p3a_en_vdet_1:1;
        /** ana_0p3a_en_cur_lim_1 : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t ana_0p3a_en_cur_lim_1:1;
        /** ana_0p3a_dref_1 : R/W; bitpos: [31:28]; default: 10;
         *  need_des
         */
        uint32_t ana_0p3a_dref_1:4;
    };
    uint32_t val;
} pmu_ext_ldo_p1_0p3a_ana_reg_t;

/** Type of ext_wakeup_lv register
 *  need_des
 */
typedef union {
    struct {
        /** ext_wakeup_lv : R/W; bitpos: [31:0]; default: 0;
         *  need_des
         */
        uint32_t ext_wakeup_lv:32;
    };
    uint32_t val;
} pmu_ext_wakeup_lv_reg_t;

