espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_eco5_struct.h
/** Type of ext_wakeup_sel register
 *  need_des
 */
typedef union {
    struct {
        /** ext_wakeup_sel : R/W; bitpos: [31:0]; default: 0;
         *  need_des
         */
        uint32_t ext_wakeup_sel:32;
    };
    uint32_t val;
} pmu_ext_wakeup_sel_reg_t;

/** Type of ext_wakeup_st register
 *  need_des
 */
typedef union {
    struct {
        /** ext_wakeup_status : RO; bitpos: [31:0]; default: 0;
         *  need_des
         */
        uint32_t ext_wakeup_status:32;
    };
    uint32_t val;
} pmu_ext_wakeup_st_reg_t;

/** Type of ext_wakeup_cntl register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:30;
        /** ext_wakeup_status_clr : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t ext_wakeup_status_clr:1;
        /** ext_wakeup_filter : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t ext_wakeup_filter:1;
    };
    uint32_t val;
} pmu_ext_wakeup_cntl_reg_t;

/** Type of sdio_wakeup_cntl register
 *  need_des
 */
typedef union {
    struct {
        /** sdio_act_dnum : R/W; bitpos: [9:0]; default: 1023;
         *  need_des
         */
        uint32_t sdio_act_dnum:10;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} pmu_sdio_wakeup_cntl_reg_t;

/** Type of cpu_sw_stall register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** hpcore1_sw_stall_code : R/W; bitpos: [23:16]; default: 0;
         *  need_des
         */
        uint32_t hpcore1_sw_stall_code:8;
        /** hpcore0_sw_stall_code : R/W; bitpos: [31:24]; default: 0;
         *  need_des
         */
        uint32_t hpcore0_sw_stall_code:8;
    };
    uint32_t val;
} pmu_cpu_sw_stall_reg_t;

/** Type of dcm_ctrl register
 *  need_des
 */
typedef union {
    struct {
        /** dcdc_on_req : WT; bitpos: [0]; default: 0;
         *  SW trigger dcdc on
         */
        uint32_t dcdc_on_req:1;
        /** dcdc_off_req : WT; bitpos: [1]; default: 0;
         *  SW trigger dcdc off
         */
        uint32_t dcdc_off_req:1;
        /** dcdc_lightslp_req : WT; bitpos: [2]; default: 0;
         *  SW trigger dcdc enter lightsleep
         */
        uint32_t dcdc_lightslp_req:1;
        /** dcdc_deepslp_req : WT; bitpos: [3]; default: 0;
         *  SW trigger dcdc enter deepsleep
         */
        uint32_t dcdc_deepslp_req:1;
        uint32_t reserved_4:3;
        /** dcdc_done_force : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t dcdc_done_force:1;
        /** dcdc_on_force_pu : R/W; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t dcdc_on_force_pu:1;
        /** dcdc_on_force_pd : R/W; bitpos: [9]; default: 0;
         *  need_des
         */
        uint32_t dcdc_on_force_pd:1;
        /** dcdc_fb_res_force_pu : R/W; bitpos: [10]; default: 0;
         *  need_des
         */
        uint32_t dcdc_fb_res_force_pu:1;
        /** dcdc_fb_res_force_pd : R/W; bitpos: [11]; default: 0;
         *  need_des
         */
        uint32_t dcdc_fb_res_force_pd:1;
        /** dcdc_ls_force_pu : R/W; bitpos: [12]; default: 0;
         *  need_des
         */
        uint32_t dcdc_ls_force_pu:1;
        /** dcdc_ls_force_pd : R/W; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t dcdc_ls_force_pd:1;
        /** dcdc_ds_force_pu : R/W; bitpos: [14]; default: 0;
         *  need_des
         */
        uint32_t dcdc_ds_force_pu:1;
        /** dcdc_ds_force_pd : R/W; bitpos: [15]; default: 0;
         *  need_des
         */
        uint32_t dcdc_ds_force_pd:1;
        /** dcm_cur_st : RO; bitpos: [23:16]; default: 1;
         *  need_des
         */
        uint32_t dcm_cur_st:8;
        uint32_t reserved_24:5;
        /** dcdc_en_amux_test : R/W; bitpos: [29]; default: 0;
         *  Enable analog mux to pull PAD TEST_DCDC voltage signal
         */
        uint32_t dcdc_en_amux_test:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} pmu_dcm_ctrl_reg_t;

/** Type of dcm_wait_delay register
 *  need_des
 */
typedef union {
    struct {
        /** dcdc_pre_delay : R/W; bitpos: [7:0]; default: 5;
         *  DCDC pre-on/post off delay
         */
        uint32_t dcdc_pre_delay:8;
        /** dcdc_res_off_delay : R/W; bitpos: [15:8]; default: 2;
         *  DCDC fb res off delay
         */
        uint32_t dcdc_res_off_delay:8;
        /** dcdc_stable_delay : R/W; bitpos: [25:16]; default: 75;
         *  DCDC stable delay
         */
        uint32_t dcdc_stable_delay:10;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} pmu_dcm_wait_delay_reg_t;

/** Type of vddbat_cfg register
 *  need_des
 */
typedef union {
    struct {
        /** ana_vddbat_mode : RO; bitpos: [1:0]; default: 0;
         *  need_des
         */
        uint32_t ana_vddbat_mode:2;
        uint32_t reserved_2:29;
        /** vddbat_sw_update : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t vddbat_sw_update:1;
    };
    uint32_t val;
} pmu_vddbat_cfg_reg_t;

/** Type of touch_pwr_cntl register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** touch_wait_cycles : R/W; bitpos: [13:5]; default: 10;
         *  need_des
         */
        uint32_t touch_wait_cycles:9;
        /** touch_sleep_cycles : R/W; bitpos: [29:14]; default: 100;
         *  need_des
         */
        uint32_t touch_sleep_cycles:16;
        /** touch_force_done : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t touch_force_done:1;
        /** touch_sleep_timer_en : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t touch_sleep_timer_en:1;
    };
    uint32_t val;
} pmu_touch_pwr_cntl_reg_t;

/** Type of rdn_eco register
 *  need_des
 */
typedef union {
    struct {
        /** pmu_rdn_eco_result : RO; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t pmu_rdn_eco_result:1;
        uint32_t reserved_1:30;
        /** pmu_rdn_eco_en : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t pmu_rdn_eco_en:1;
    };
    uint32_t val;
} pmu_rdn_eco_reg_t;

/** Type of power_pd_hp_cpu_cntl register
 *  need_des
 */
typedef union {
    struct {
        /** force_hp_cpu_reset : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t force_hp_cpu_reset:1;
        /** force_hp_cpu_iso : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t force_hp_cpu_iso:1;
        /** force_hp_cpu_pu : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t force_hp_cpu_pu:1;
        /** force_hp_cpu_no_reset : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t force_hp_cpu_no_reset:1;
        /** force_hp_cpu_no_iso : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t force_hp_cpu_no_iso:1;
        /** force_hp_cpu_pd : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t force_hp_cpu_pd:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} pmu_power_pd_hp_cpu_cntl_reg_t;

/** Type of power_pd_hp_cpu_mask register
 *  need_des
 */
typedef union {
    struct {
        /** xpd_hp_cpu_mask : R/W; bitpos: [4:0]; default: 0;
         *  need_des
         */
        uint32_t xpd_hp_cpu_mask:5;
        uint32_t reserved_5:22;
        /** pd_hp_cpu_mask : R/W; bitpos: [31:27]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_cpu_mask:5;
    };
    uint32_t val;
} pmu_power_pd_hp_cpu_mask_reg_t;

/** Type of date register
 *  need_des
 */
typedef union {
    struct {
        /** pmu_date : R/W; bitpos: [30:0]; default: 38801456;
         *  need_des
         */
        uint32_t pmu_date:31;
        /** clk_en : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t clk_en:1;
    };
    uint32_t val;
} pmu_date_reg_t;


/** Group: status_register */
/** Type of clk_state0 register
 *  need_des
 */
typedef union {
    struct {
        /** stable_xpd_pll_state : RO; bitpos: [2:0]; default: 0;
         *  need_des
         */
        uint32_t stable_xpd_pll_state:3;
        /** stable_xpd_xtal_state : RO; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t stable_xpd_xtal_state:1;
        /** pmu_ana_xpd_pll_i2c_state : RO; bitpos: [6:4]; default: 0;
         *  need_des
         */
        uint32_t pmu_ana_xpd_pll_i2c_state:3;
        uint32_t reserved_7:3;
        /** pmu_sys_clk_slp_sel_state : RO; bitpos: [10]; default: 0;
         *  need_des
         */
        uint32_t pmu_sys_clk_slp_sel_state:1;
        /** pmu_sys_clk_sel_state : RO; bitpos: [12:11]; default: 0;
         *  need_des
         */
        uint32_t pmu_sys_clk_sel_state:2;
        /** pmu_sys_clk_no_div_state : RO; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t pmu_sys_clk_no_div_state:1;
        /** pmu_icg_sys_clk_en_state : RO; bitpos: [14]; default: 1;
         *  need_des
         */
        uint32_t pmu_icg_sys_clk_en_state:1;
        /** pmu_icg_modem_switch_state : RO; bitpos: [15]; default: 0;
         *  need_des
         */
        uint32_t pmu_icg_modem_switch_state:1;
        /** pmu_icg_modem_code_state : RO; bitpos: [17:16]; default: 0;
         *  need_des
         */
        uint32_t pmu_icg_modem_code_state:2;
        /** pmu_icg_slp_sel_state : RO; bitpos: [18]; default: 0;
         *  need_des
         */
        uint32_t pmu_icg_slp_sel_state:1;
        /** pmu_icg_global_xtal_state : RO; bitpos: [19]; default: 0;
         *  need_des
         */
        uint32_t pmu_icg_global_xtal_state:1;
        /** pmu_icg_global_pll_state : RO; bitpos: [23:20]; default: 0;
         *  need_des
         */
        uint32_t pmu_icg_global_pll_state:4;
        /** pmu_ana_i2c_iso_en_state : RO; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t pmu_ana_i2c_iso_en_state:1;
        /** pmu_ana_i2c_retention_state : RO; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t pmu_ana_i2c_retention_state:1;
        uint32_t reserved_26:1;
        /** pmu_ana_xpd_pll_state : RO; bitpos: [30:27]; default: 0;
         *  need_des
         */
        uint32_t pmu_ana_xpd_pll_state:4;
        /** pmu_ana_xpd_xtal_state : RO; bitpos: [31]; default: 1;
         *  need_des
         */
        uint32_t pmu_ana_xpd_xtal_state:1;
    };
    uint32_t val;
} pmu_clk_state0_reg_t;

/** Type of clk_state1 register
 *  need_des
 */
typedef union {
    struct {
        /** pmu_icg_func_en_state : RO; bitpos: [31:0]; default: 4294967295;
         *  need_des
         */
        uint32_t pmu_icg_func_en_state:32;
    };
    uint32_t val;
} pmu_clk_state1_reg_t;

/** Type of clk_state2 register
 *  need_des
 */
typedef union {
    struct {
        /** pmu_icg_apb_en_state : RO; bitpos: [31:0]; default: 4294967295;
         *  need_des
         */
        uint32_t pmu_icg_apb_en_state:32;
    };
    uint32_t val;
} pmu_clk_state2_reg_t;

/** Type of xtal_slp register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** xtal_slp_cnt_target : R/W; bitpos: [31:16]; default: 15;
         *  need_des
         */
        uint32_t xtal_slp_cnt_target:16;
    };
    uint32_t val;
} pmu_xtal_slp_reg_t;


