espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_eco5_struct.h
typedef struct {
    volatile pmu_hp_active_dig_power_reg_t hp_active_dig_power;
    volatile pmu_hp_active_icg_hp_func_reg_t hp_active_icg_hp_func;
    volatile pmu_hp_active_icg_hp_apb_reg_t hp_active_icg_hp_apb;
    volatile pmu_hp_active_icg_modem_reg_t hp_active_icg_modem;
    volatile pmu_hp_active_hp_sys_cntl_reg_t hp_active_hp_sys_cntl;
    volatile pmu_hp_active_hp_ck_power_reg_t hp_active_hp_ck_power;
    volatile pmu_hp_active_bias_reg_t hp_active_bias;
    volatile pmu_hp_active_backup_reg_t hp_active_backup;
    volatile pmu_hp_active_backup_clk_reg_t hp_active_backup_clk;
    volatile pmu_hp_active_sysclk_reg_t hp_active_sysclk;
    volatile pmu_hp_active_hp_regulator0_reg_t hp_active_hp_regulator0;
    volatile pmu_hp_active_hp_regulator1_reg_t hp_active_hp_regulator1;
    volatile pmu_hp_active_xtal_reg_t hp_active_xtal;
    volatile pmu_hp_modem_dig_power_reg_t hp_modem_dig_power;
    volatile pmu_hp_modem_icg_hp_func_reg_t hp_modem_icg_hp_func;
    volatile pmu_hp_modem_icg_hp_apb_reg_t hp_modem_icg_hp_apb;
    volatile pmu_hp_modem_icg_modem_reg_t hp_modem_icg_modem;
    volatile pmu_hp_modem_hp_sys_cntl_reg_t hp_modem_hp_sys_cntl;
    volatile pmu_hp_modem_hp_ck_power_reg_t hp_modem_hp_ck_power;
    volatile pmu_hp_modem_bias_reg_t hp_modem_bias;
    volatile pmu_hp_modem_backup_reg_t hp_modem_backup;
    volatile pmu_hp_modem_backup_clk_reg_t hp_modem_backup_clk;
    volatile pmu_hp_modem_sysclk_reg_t hp_modem_sysclk;
    volatile pmu_hp_modem_hp_regulator0_reg_t hp_modem_hp_regulator0;
    volatile pmu_hp_modem_hp_regulator1_reg_t hp_modem_hp_regulator1;
    volatile pmu_hp_modem_xtal_reg_t hp_modem_xtal;
    volatile pmu_hp_sleep_dig_power_reg_t hp_sleep_dig_power;
    volatile pmu_hp_sleep_icg_hp_func_reg_t hp_sleep_icg_hp_func;
    volatile pmu_hp_sleep_icg_hp_apb_reg_t hp_sleep_icg_hp_apb;
    volatile pmu_hp_sleep_icg_modem_reg_t hp_sleep_icg_modem;
    volatile pmu_hp_sleep_hp_sys_cntl_reg_t hp_sleep_hp_sys_cntl;
    volatile pmu_hp_sleep_hp_ck_power_reg_t hp_sleep_hp_ck_power;
    volatile pmu_hp_sleep_bias_reg_t hp_sleep_bias;
    volatile pmu_hp_sleep_backup_reg_t hp_sleep_backup;
    volatile pmu_hp_sleep_backup_clk_reg_t hp_sleep_backup_clk;
    volatile pmu_hp_sleep_sysclk_reg_t hp_sleep_sysclk;
    volatile pmu_hp_sleep_hp_regulator0_reg_t hp_sleep_hp_regulator0;
    volatile pmu_hp_sleep_hp_regulator1_reg_t hp_sleep_hp_regulator1;
    volatile pmu_hp_sleep_xtal_reg_t hp_sleep_xtal;
    volatile pmu_hp_sleep_lp_regulator0_reg_t hp_sleep_lp_regulator0;
    volatile pmu_hp_sleep_lp_regulator1_reg_t hp_sleep_lp_regulator1;
    uint32_t reserved_0a4;
    volatile pmu_hp_sleep_lp_dig_power_reg_t hp_sleep_lp_dig_power;
    volatile pmu_hp_sleep_lp_ck_power_reg_t hp_sleep_lp_ck_power;
    uint32_t reserved_0b0;
    volatile pmu_lp_sleep_lp_regulator0_reg_t lp_sleep_lp_regulator0;
    volatile pmu_lp_sleep_lp_regulator1_reg_t lp_sleep_lp_regulator1;
    volatile pmu_lp_sleep_xtal_reg_t lp_sleep_xtal;
    volatile pmu_lp_sleep_lp_dig_power_reg_t lp_sleep_lp_dig_power;
    volatile pmu_lp_sleep_lp_ck_power_reg_t lp_sleep_lp_ck_power;
    volatile pmu_lp_sleep_bias_reg_t lp_sleep_bias;
    volatile pmu_imm_hp_ck_power_reg_t imm_hp_ck_power;
    volatile pmu_imm_sleep_sysclk_reg_t imm_sleep_sysclk;
    volatile pmu_imm_hp_func_icg_reg_t imm_hp_func_icg;
    volatile pmu_imm_hp_apb_icg_reg_t imm_hp_apb_icg;
    volatile pmu_imm_modem_icg_reg_t imm_modem_icg;
    volatile pmu_imm_lp_icg_reg_t imm_lp_icg;
    volatile pmu_imm_pad_hold_all_reg_t imm_pad_hold_all;
    volatile pmu_imm_i2c_iso_reg_t imm_i2c_iso;
    volatile pmu_power_wait_timer0_reg_t power_wait_timer0;
    volatile pmu_power_wait_timer1_reg_t power_wait_timer1;
    volatile pmu_power_pd_top_cntl_reg_t power_pd_top_cntl;
    volatile pmu_power_pd_cnnt_cntl_reg_t power_pd_cnnt_cntl;
    volatile pmu_power_pd_hpmem_cntl_reg_t power_pd_hpmem_cntl;
    volatile pmu_power_pd_top_mask_reg_t power_pd_top_mask;
    volatile pmu_power_pd_cnnt_mask_reg_t power_pd_cnnt_mask;
    volatile pmu_power_pd_hpmem_mask_reg_t power_pd_hpmem_mask;
    volatile pmu_power_dcdc_switch_reg_t power_dcdc_switch;
    volatile pmu_power_pd_lpperi_cntl_reg_t power_pd_lpperi_cntl;
    volatile pmu_power_pd_lpperi_mask_reg_t power_pd_lpperi_mask;
    volatile pmu_power_hp_pad_reg_t power_hp_pad;
    volatile pmu_power_ck_wait_cntl_reg_t power_ck_wait_cntl;
    volatile pmu_slp_wakeup_cntl0_reg_t slp_wakeup_cntl0;
    volatile pmu_slp_wakeup_cntl1_reg_t slp_wakeup_cntl1;
    volatile pmu_slp_wakeup_cntl2_reg_t slp_wakeup_cntl2;
    volatile pmu_slp_wakeup_cntl3_reg_t slp_wakeup_cntl3;
    volatile pmu_slp_wakeup_cntl4_reg_t slp_wakeup_cntl4;
    volatile pmu_slp_wakeup_cntl5_reg_t slp_wakeup_cntl5;
    volatile pmu_slp_wakeup_cntl6_reg_t slp_wakeup_cntl6;
    volatile pmu_slp_wakeup_cntl7_reg_t slp_wakeup_cntl7;
    volatile pmu_slp_wakeup_cntl8_reg_t slp_wakeup_cntl8;
    volatile pmu_slp_wakeup_status0_reg_t slp_wakeup_status0;
    volatile pmu_slp_wakeup_status1_reg_t slp_wakeup_status1;
    volatile pmu_slp_wakeup_status2_reg_t slp_wakeup_status2;
    volatile pmu_hp_ck_poweron_reg_t hp_ck_poweron;
    volatile pmu_hp_ck_cntl_reg_t hp_ck_cntl;
    volatile pmu_por_status_reg_t por_status;
    volatile pmu_rf_pwc_reg_t rf_pwc;
    volatile pmu_backup_cfg_reg_t backup_cfg;
    volatile pmu_int_raw_reg_t int_raw;
    volatile pmu_hp_int_st_reg_t hp_int_st;
    volatile pmu_hp_int_ena_reg_t hp_int_ena;
    volatile pmu_hp_int_clr_reg_t hp_int_clr;
    volatile pmu_lp_int_raw_reg_t lp_int_raw;
    volatile pmu_lp_int_st_reg_t lp_int_st;
    volatile pmu_lp_int_ena_reg_t lp_int_ena;
    volatile pmu_lp_int_clr_reg_t lp_int_clr;
    volatile pmu_lp_cpu_pwr0_reg_t lp_cpu_pwr0;
    volatile pmu_lp_cpu_pwr1_reg_t lp_cpu_pwr1;
    volatile pmu_lp_cpu_pwr2_reg_t lp_cpu_pwr2;
    volatile pmu_lp_cpu_pwr3_reg_t lp_cpu_pwr3;
    volatile pmu_lp_cpu_pwr4_reg_t lp_cpu_pwr4;
    volatile pmu_lp_cpu_pwr5_reg_t lp_cpu_pwr5;
    volatile pmu_hp_lp_cpu_comm_reg_t hp_lp_cpu_comm;
    volatile pmu_hp_regulator_cfg_reg_t hp_regulator_cfg;
    volatile pmu_main_state_reg_t main_state;
    volatile pmu_pwr_state_reg_t pwr_state;
    volatile pmu_clk_state0_reg_t clk_state0;
    volatile pmu_clk_state1_reg_t clk_state1;
    volatile pmu_clk_state2_reg_t clk_state2;
    volatile pmu_ext_ldo_p0_0p1a_reg_t ext_ldo_p0_0p1a;
    volatile pmu_ext_ldo_p0_0p1a_ana_reg_t ext_ldo_p0_0p1a_ana;
    volatile pmu_ext_ldo_p0_0p2a_reg_t ext_ldo_p0_0p2a;
    volatile pmu_ext_ldo_p0_0p2a_ana_reg_t ext_ldo_p0_0p2a_ana;
    volatile pmu_ext_ldo_p0_0p3a_reg_t ext_ldo_p0_0p3a;
    volatile pmu_ext_ldo_p0_0p3a_ana_reg_t ext_ldo_p0_0p3a_ana;
    volatile pmu_ext_ldo_p1_0p1a_reg_t ext_ldo_p1_0p1a;
    volatile pmu_ext_ldo_p1_0p1a_ana_reg_t ext_ldo_p1_0p1a_ana;
    volatile pmu_ext_ldo_p1_0p2a_reg_t ext_ldo_p1_0p2a;
    volatile pmu_ext_ldo_p1_0p2a_ana_reg_t ext_ldo_p1_0p2a_ana;
    volatile pmu_ext_ldo_p1_0p3a_reg_t ext_ldo_p1_0p3a;
    volatile pmu_ext_ldo_p1_0p3a_ana_reg_t ext_ldo_p1_0p3a_ana;
    volatile pmu_ext_wakeup_lv_reg_t ext_wakeup_lv;
    volatile pmu_ext_wakeup_sel_reg_t ext_wakeup_sel;
    volatile pmu_ext_wakeup_st_reg_t ext_wakeup_st;
    volatile pmu_ext_wakeup_cntl_reg_t ext_wakeup_cntl;
    volatile pmu_sdio_wakeup_cntl_reg_t sdio_wakeup_cntl;
    volatile pmu_xtal_slp_reg_t xtal_slp;
    volatile pmu_cpu_sw_stall_reg_t cpu_sw_stall;
    volatile pmu_dcm_ctrl_reg_t dcm_ctrl;
    volatile pmu_dcm_wait_delay_reg_t dcm_wait_delay;
    volatile pmu_vddbat_cfg_reg_t vddbat_cfg;
    volatile pmu_touch_pwr_cntl_reg_t touch_pwr_cntl;
    volatile pmu_rdn_eco_reg_t rdn_eco;
    volatile pmu_power_pd_hp_cpu_cntl_reg_t power_pd_hp_cpu_cntl;
    volatile pmu_power_pd_hp_cpu_mask_reg_t power_pd_hp_cpu_mask;
    uint32_t reserved_220[119];
    volatile pmu_date_reg_t date;
} pmu_dev_t;

extern pmu_dev_t PMU;

#ifndef __cplusplus
_Static_assert(sizeof(pmu_dev_t) == 0x400, "Invalid size of pmu_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
